; domain
;;Created by Tomas de la Rosa
;;Domain for painting floor tiles with two colors

(define (domain floor-tile)
(:requirements :typing)
(:types robot tile color - object)

(:predicates 	
		(robot-at ?r - robot ?x - tile)
		(tile-up ?x - tile ?y - tile)
		(tile-down ?x - tile ?y - tile)
		(tile-right ?x - tile ?y - tile)
		(tile-left ?x - tile ?y - tile)
		
		(clear ?x - tile)
                (painted ?x - tile ?c - color)
		(robot-has ?r - robot ?c - color)
                (available-color ?c - color)
                (free-color ?r - robot))


(:action change-color
  :parameters (?r - robot ?c - color ?c2 - color)
  :precondition (and (robot-has ?r ?c) (available-color ?c2))
  :effect (and (not (robot-has ?r ?c)) (robot-has ?r ?c2))
) 


(:action paint-up
  :parameters (?r - robot ?y - tile ?x - tile ?c - color)
  :precondition (and (robot-has ?r ?c) (robot-at ?r ?x) (tile-up ?y ?x) (clear ?y))
  :effect (and (not (clear ?y)) (painted ?y ?c))
)


(:action paint-down
  :parameters (?r - robot ?y - tile ?x - tile ?c - color)
  :precondition (and (robot-has ?r ?c) (robot-at ?r ?x) (tile-down ?y ?x) (clear ?y))
  :effect (and (not (clear ?y)) (painted ?y ?c))
)


; Robot movements
(:action up 
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (tile-up ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y)))
)


(:action down 
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (tile-down ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y))
               (increase (total-cost) 1))
)

(:action right 
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (tile-right ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y)))
)

(:action left 
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (tile-left ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y)))
)

)

; problem
(define (problem p1)
 (:domain floor-tile)
 (:objects tile-0-1 tile-0-2 tile-0-3 tile-0-4 
           tile-1-1 tile-1-2 tile-1-3 tile-1-4 
           tile-2-1 tile-2-2 tile-2-3 tile-2-4 
           tile-3-1 tile-3-2 tile-3-3 tile-3-4 
           tile-4-1 tile-4-2 tile-4-3 tile-4-4 - tile
           robot1 robot2 - robot
           white black - color
)
 (:init 
   (robot-at robot1 tile-3-3)
   (robot-has robot1 white)
   (robot-at robot2 tile-0-1)
   (robot-has robot2 black)
   (available-color white)
   (available-color black)
   (clear tile-0-2)
   (clear tile-0-3)
   (clear tile-0-4)
   (clear tile-1-1)
   (clear tile-1-2)
   (clear tile-1-3)
   (clear tile-1-4)
   (clear tile-2-1)
   (clear tile-2-2)
   (clear tile-2-3)
   (clear tile-2-4)
   (clear tile-3-1)
   (clear tile-3-2)
   (clear tile-3-4)
   (clear tile-4-1)
   (clear tile-4-2)
   (clear tile-4-3)
   (clear tile-4-4)
   (tile-up tile-1-1 tile-0-1)
   (tile-up tile-1-2 tile-0-2)
   (tile-up tile-1-3 tile-0-3)
   (tile-up tile-1-4 tile-0-4)
   (tile-up tile-2-1 tile-1-1)
   (tile-up tile-2-2 tile-1-2)
   (tile-up tile-2-3 tile-1-3)
   (tile-up tile-2-4 tile-1-4)
   (tile-up tile-3-1 tile-2-1)
   (tile-up tile-3-2 tile-2-2)
   (tile-up tile-3-3 tile-2-3)
   (tile-up tile-3-4 tile-2-4)
   (tile-up tile-4-1 tile-3-1)
   (tile-up tile-4-2 tile-3-2)
   (tile-up tile-4-3 tile-3-3)
   (tile-up tile-4-4 tile-3-4)
   (tile-down tile-0-1 tile-1-1)
   (tile-down tile-0-2 tile-1-2)
   (tile-down tile-0-3 tile-1-3)
   (tile-down tile-0-4 tile-1-4)
   (tile-down tile-1-1 tile-2-1)
   (tile-down tile-1-2 tile-2-2)
   (tile-down tile-1-3 tile-2-3)
   (tile-down tile-1-4 tile-2-4)
   (tile-down tile-2-1 tile-3-1)
   (tile-down tile-2-2 tile-3-2)
   (tile-down tile-2-3 tile-3-3)
   (tile-down tile-2-4 tile-3-4)
   (tile-down tile-3-1 tile-4-1)
   (tile-down tile-3-2 tile-4-2)
   (tile-down tile-3-3 tile-4-3)
   (tile-down tile-3-4 tile-4-4)
   (tile-right tile-0-2 tile-0-1)
   (tile-right tile-0-3 tile-0-2)
   (tile-right tile-0-4 tile-0-3)
   (tile-right tile-1-2 tile-1-1)
   (tile-right tile-1-3 tile-1-2)
   (tile-right tile-1-4 tile-1-3)
   (tile-right tile-2-2 tile-2-1)
   (tile-right tile-2-3 tile-2-2)
   (tile-right tile-2-4 tile-2-3)
   (tile-right tile-3-2 tile-3-1)
   (tile-right tile-3-3 tile-3-2)
   (tile-right tile-3-4 tile-3-3)
   (tile-right tile-4-2 tile-4-1)
   (tile-right tile-4-3 tile-4-2)
   (tile-right tile-4-4 tile-4-3)
   (tile-left tile-0-1 tile-0-2)
   (tile-left tile-0-2 tile-0-3)
   (tile-left tile-0-3 tile-0-4)
   (tile-left tile-1-1 tile-1-2)
   (tile-left tile-1-2 tile-1-3)
   (tile-left tile-1-3 tile-1-4)
   (tile-left tile-2-1 tile-2-2)
   (tile-left tile-2-2 tile-2-3)
   (tile-left tile-2-3 tile-2-4)
   (tile-left tile-3-1 tile-3-2)
   (tile-left tile-3-2 tile-3-3)
   (tile-left tile-3-3 tile-3-4)
   (tile-left tile-4-1 tile-4-2)
   (tile-left tile-4-2 tile-4-3)
   (tile-left tile-4-3 tile-4-4)
)
 (:goal (and
    (painted tile-1-1 white)
    (painted tile-1-2 black)
    (painted tile-1-3 white)
    (painted tile-1-4 black)
    (painted tile-2-1 black)
    (painted tile-2-2 white)
    (painted tile-2-3 black)
    (painted tile-2-4 white)
    (painted tile-3-1 white)
    (painted tile-3-2 black)
    (painted tile-3-3 white)
    (painted tile-3-4 black)
    (painted tile-4-1 black)
    (painted tile-4-2 white)
    (painted tile-4-3 black)
    (painted tile-4-4 white)
))
 
)

; plan
1. (right robot1 tile-3-3 tile-3-4)
   deleted: (robot-at robot1 tile-3-3) (clear tile-3-4)
   added: (robot-at robot1 tile-3-4) (clear tile-3-3)
   goals met: 0 of 16
2. (paint-up robot1 tile-4-4 tile-3-4 white)
   deleted: (clear tile-4-4)
   added: (painted tile-4-4 white)
   goals met: 1 of 16
3. (change-color robot1 white black)
   deleted: (robot-has robot1 white)
   added: (robot-has robot1 black)
   goals met: 1 of 16
4. (down robot1 tile-3-4 tile-2-4)
   deleted: (robot-at robot1 tile-3-4) (clear tile-2-4)
   added: (robot-at robot1 tile-2-4) (clear tile-3-4)
   goals met: 1 of 16
5. (paint-up robot1 tile-3-4 tile-2-4 black)
   deleted: (clear tile-3-4)
   added: (painted tile-3-4 black)
   goals met: 2 of 16
6. (left robot1 tile-2-4 tile-2-3)
   deleted: (robot-at robot1 tile-2-4) (clear tile-2-3)
   added: (robot-at robot1 tile-2-3) (clear tile-2-4)
   goals met: 2 of 16
7. (up robot1 tile-2-3 tile-3-3)
   deleted: (robot-at robot1 tile-2-3) (clear tile-3-3)
   added: (robot-at robot1 tile-3-3) (clear tile-2-3)
   goals met: 2 of 16
8. (left robot1 tile-3-3 tile-3-2)
   deleted: (robot-at robot1 tile-3-3) (clear tile-3-2)
   added: (robot-at robot1 tile-3-2) (clear tile-3-3)
   goals met: 2 of 16
9. (left robot1 tile-3-2 tile-3-1)
   deleted: (robot-at robot1 tile-3-2) (clear tile-3-1)
   added: (robot-at robot1 tile-3-1) (clear tile-3-2)
   goals met: 2 of 16
10. (paint-up robot1 tile-4-1 tile-3-1 black)
   deleted: (clear tile-4-1)
   added: (painted tile-4-1 black)
   goals met: 3 of 16
11. (change-color robot1 black white)
   deleted: (robot-has robot1 black)
   added: (robot-has robot1 white)
   goals met: 3 of 16
12. (right robot1 tile-3-1 tile-3-2)
   deleted: (robot-at robot1 tile-3-1) (clear tile-3-2)
   added: (robot-at robot1 tile-3-2) (clear tile-3-1)
   goals met: 3 of 16
13. (change-color robot2 black white)
   deleted: (robot-has robot2 black)
   added: (robot-has robot2 white)
   goals met: 3 of 16
14. (up robot2 tile-0-1 tile-1-1)
   deleted: (robot-at robot2 tile-0-1) (clear tile-1-1)
   added: (robot-at robot2 tile-1-1) (clear tile-0-1)
   goals met: 3 of 16
15. (up robot2 tile-1-1 tile-2-1)
   deleted: (robot-at robot2 tile-1-1) (clear tile-2-1)
   added: (robot-at robot2 tile-2-1) (clear tile-1-1)
   goals met: 3 of 16
16. (paint-up robot2 tile-3-1 tile-2-1 white)
   deleted: (clear tile-3-1)
   added: (painted tile-3-1 white)
   goals met: 4 of 16
17. (change-color robot2 white black)
   deleted: (robot-has robot2 white)
   added: (robot-has robot2 black)
   goals met: 4 of 16
18. (down robot2 tile-2-1 tile-1-1)
   deleted: (robot-at robot2 tile-2-1) (clear tile-1-1)
   added: (robot-at robot2 tile-1-1) (clear tile-2-1)
   goals met: 4 of 16
19. (paint-up robot2 tile-2-1 tile-1-1 black)
   deleted: (clear tile-2-1)
   added: (painted tile-2-1 black)
   goals met: 5 of 16
20. (paint-up robot1 tile-4-2 tile-3-2 white)
   deleted: (clear tile-4-2)
   added: (painted tile-4-2 white)
   goals met: 6 of 16
21. (right robot2 tile-1-1 tile-1-2)
   deleted: (robot-at robot2 tile-1-1) (clear tile-1-2)
   added: (robot-at robot2 tile-1-2) (clear tile-1-1)
   goals met: 6 of 16
22. (up robot2 tile-1-2 tile-2-2)
   deleted: (robot-at robot2 tile-1-2) (clear tile-2-2)
   added: (robot-at robot2 tile-2-2) (clear tile-1-2)
   goals met: 6 of 16
23. (right robot1 tile-3-2 tile-3-3)
   deleted: (robot-at robot1 tile-3-2) (clear tile-3-3)
   added: (robot-at robot1 tile-3-3) (clear tile-3-2)
   goals met: 6 of 16
24. (paint-up robot2 tile-3-2 tile-2-2 black)
   deleted: (clear tile-3-2)
   added: (painted tile-3-2 black)
   goals met: 7 of 16
25. (change-color robot2 black white)
   deleted: (robot-has robot2 black)
   added: (robot-has robot2 white)
   goals met: 7 of 16
26. (down robot2 tile-2-2 tile-1-2)
   deleted: (robot-at robot2 tile-2-2) (clear tile-1-2)
   added: (robot-at robot2 tile-1-2) (clear tile-2-2)
   goals met: 7 of 16
27. (paint-up robot2 tile-2-2 tile-1-2 white)
   deleted: (clear tile-2-2)
   added: (painted tile-2-2 white)
   goals met: 8 of 16
28. (change-color robot1 white black)
   deleted: (robot-has robot1 white)
   added: (robot-has robot1 black)
   goals met: 8 of 16
29. (paint-up robot1 tile-4-3 tile-3-3 black)
   deleted: (clear tile-4-3)
   added: (painted tile-4-3 black)
   goals met: 9 of 16
30. (change-color robot1 black white)
   deleted: (robot-has robot1 black)
   added: (robot-has robot1 white)
   goals met: 9 of 16
31. (down robot1 tile-3-3 tile-2-3)
   deleted: (robot-at robot1 tile-3-3) (clear tile-2-3)
   added: (robot-at robot1 tile-2-3) (clear tile-3-3)
   goals met: 9 of 16
32. (paint-up robot1 tile-3-3 tile-2-3 white)
   deleted: (clear tile-3-3)
   added: (painted tile-3-3 white)
   goals met: 10 of 16
33. (change-color robot1 white black)
   deleted: (robot-has robot1 white)
   added: (robot-has robot1 black)
   goals met: 10 of 16
34. (down robot1 tile-2-3 tile-1-3)
   deleted: (robot-at robot1 tile-2-3) (clear tile-1-3)
   added: (robot-at robot1 tile-1-3) (clear tile-2-3)
   goals met: 10 of 16
35. (paint-up robot1 tile-2-3 tile-1-3 black)
   deleted: (clear tile-2-3)
   added: (painted tile-2-3 black)
   goals met: 11 of 16
36. (change-color robot1 black white)
   deleted: (robot-has robot1 black)
   added: (robot-has robot1 white)
   goals met: 11 of 16
37. (right robot1 tile-1-3 tile-1-4)
   deleted: (robot-at robot1 tile-1-3) (clear tile-1-4)
   added: (robot-at robot1 tile-1-4) (clear tile-1-3)
   goals met: 11 of 16
38. (paint-up robot1 tile-2-4 tile-1-4 white)
   deleted: (clear tile-2-4)
   added: (painted tile-2-4 white)
   goals met: 12 of 16
39. (down robot2 tile-1-2 tile-0-2)
   deleted: (robot-at robot2 tile-1-2) (clear tile-0-2)
   added: (robot-at robot2 tile-0-2) (clear tile-1-2)
   goals met: 12 of 16
40. (left robot2 tile-0-2 tile-0-1)
   deleted: (robot-at robot2 tile-0-2) (clear tile-0-1)
   added: (robot-at robot2 tile-0-1) (clear tile-0-2)
   goals met: 12 of 16
41. (paint-up robot2 tile-1-1 tile-0-1 white)
   deleted: (clear tile-1-1)
   added: (painted tile-1-1 white)
   goals met: 13 of 16
42. (change-color robot2 white black)
   deleted: (robot-has robot2 white)
   added: (robot-has robot2 black)
   goals met: 13 of 16
43. (right robot2 tile-0-1 tile-0-2)
   deleted: (robot-at robot2 tile-0-1) (clear tile-0-2)
   added: (robot-at robot2 tile-0-2) (clear tile-0-1)
   goals met: 13 of 16
44. (paint-up robot2 tile-1-2 tile-0-2 black)
   deleted: (clear tile-1-2)
   added: (painted tile-1-2 black)
   goals met: 14 of 16
45. (down robot1 tile-1-4 tile-0-4)
   deleted: (robot-at robot1 tile-1-4) (clear tile-0-4)
   added: (robot-at robot1 tile-0-4) (clear tile-1-4)
   goals met: 14 of 16
46. (left robot1 tile-0-4 tile-0-3)
   deleted: (robot-at robot1 tile-0-4) (clear tile-0-3)
   added: (robot-at robot1 tile-0-3) (clear tile-0-4)
   goals met: 14 of 16
47. (paint-up robot1 tile-1-3 tile-0-3 white)
   deleted: (clear tile-1-3)
   added: (painted tile-1-3 white)
   goals met: 15 of 16
48. (change-color robot1 white black)
   deleted: (robot-has robot1 white)
   added: (robot-has robot1 black)
   goals met: 15 of 16
49. (right robot1 tile-0-3 tile-0-4)
   deleted: (robot-at robot1 tile-0-3) (clear tile-0-4)
   added: (robot-at robot1 tile-0-4) (clear tile-0-3)
   goals met: 15 of 16
50. (paint-up robot1 tile-1-4 tile-0-4 black)
   deleted: (clear tile-1-4)
   added: (painted tile-1-4 black)
   goals met: 16 of 16
